Revit 2027 API
ReinforcementSettings.SetReinforcementAbbreviationTag Method
 Sets one abbreviation tag for desired ReinforcementAbbreviationTagType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType tagType,
	string abbreviationTag
)
Public Sub SetReinforcementAbbreviationTag (
	tagType As ReinforcementAbbreviationTagType,
	abbreviationTag As String
)
public:
void SetReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType tagType,
	String^ abbreviationTag
)
member SetReinforcementAbbreviationTag :
        tagType : ReinforcementAbbreviationTagType *
        abbreviationTag : string -> unit
Parameters
tagType ReinforcementAbbreviationTagType
 Defines the type of abbreviation tag.
abbreviationTag String
 Abbreviation tag value to set.
Exceptions
Exception | Condition
ArgumentException |  The abbreviation type tagType is not valid
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace